Seman2_ej1/app/controllers/laptops_controller.rb

SELECT "laptops".* FROM "laptops"
---
	def index
      @laptops = Laptop.all

SELECT  "laptops".* FROM "laptops" WHERE "laptops"."id" = ? LIMIT 1  [["id", 1]]
---
   def show
        @laptop = Laptop.find(params[:id])

SELECT  "laptops".* FROM "laptops" WHERE "laptops"."id" = ? LIMIT 1  [["id", 1]]
---
   def edit
     @laptop = Laptop.find(params[:id])